docs/1c-export-2026-06-02/InformationRegisters/ViberИсторииСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ViberИсторииСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлВБазе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочтено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактыViber</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Напрвление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Viber_Направление</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧатID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТокенСообщния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПривличения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиViber</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Непрочитаное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Видео</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/СтатусДиалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СтатусДиалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Разрешон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрещен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/ТипФайлаОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипФайлаОтправки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Видео</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоРасчетнымДокументам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/НастройкиViber.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>НастройкиViber</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Token</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПриветствия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зарегистрирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UrlViber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиЛогированиеЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиИсториюПереписки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UriИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаБот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелНом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДляОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДляСохранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/Catalogs/КонтактыViber.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>КонтактыViber</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДиалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусДиалога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривличения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиViber</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросОбласти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокСесии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Области</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-2026-06-02/CommonModules/ViberОбмен/Ext/Module.bsl
#Область Програмный_Интерфейс  

Функция СтрокаJSON(ОбъектJSON)Экспорт
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);
	
	Возврат Запись.Закрыть();
	
КонецФункции 

Функция ОбъектJSON(СтрокаJSON)Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ОбъектJSON = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат ОбъектJSON;	
	
КонецФункции

Функция ОтветJSON(Объект, КодСостояния = 200)Экспорт
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON(Объект));
	Ответ.Заголовки.Вставить("Content-Type", ТипКонтентаJSON());
	
	Возврат Ответ;	
	
КонецФункции 

Функция ПростойУспешныйОтвет()Экспорт  
	
	Результат = Новый Структура;
	Результат.Вставить("Result", "Ok");
	
	Возврат ОтветJSON(Результат);
	
КонецФункции

Функция ОтветОбОшибке(ИнформацияОбОшибке)Экспорт
	
	ЗаписьЖурналаРегистрации("НТТРСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
	Результат = Новый Структура;
	Результат.Вставить("Result", "Error");
	Результат.Вставить("ErrorText", КраткоеПредставлениеОшибки(ИнформацияОбОшибке));

	Возврат ОтветJSON(Результат, 500);	
	
КонецФункции	

Процедура ЗаписьЛогированияЗапросов(ИмяМетода, Запрос, Ответ)Экспорт

	Лог = РегистрыСведений.ВходящийНТТРЗапрос.СоздатьМенеджерЗаписи();
	Лог.ИмяМетода    = ИмяМетода;
	ТелоЗапроса  = Запрос.ПолучитьТелоКакСтроку();
		
	Попытка
		ТелоЗапроса = СтрокаJSON(ОбъектJSON(ТелоЗапроса));	
	Исключение
	КонецПопытки;
	
	Лог.ИсточникПривлечения = "Мобільний додаток";
	Лог.ТелоЗапроса  = ТелоЗапроса;	
	Лог.КодСостояния = Ответ.КодСостояния;
	Лог.Дата         = ТекущаяДатаСеанса();
	
	Лог.Записать();
	

	
КонецПроцедуры

Функция ТипКонтентаJSON()
	
	 Возврат "application/json";
	
КонецФункции	

#КонецОбласти

#Область Проциддуры_Функции_Входящего_Запроса

Функция ДанныеЗапроса(Запрос)
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	Возврат ОбъектJSON(ТелоЗапроса);	
	
КонецФункции

Функция ОбработатьВходящийЗапрос(Запрос) Экспорт
	
	ДанныеЗапроса = ДанныеЗапроса(Запрос);
	
	Если ДанныеЗапроса.method = "vibermobile" Тогда
		Возврат СформироватьИОтправитьРегистрСообщений(ДанныеЗапроса);
	ИначеЕсли ДанныеЗапроса.method = "SendMessage" Тогда
		Возврат ОбработатьИОтправитьВсемСообщения(ДанныеЗапроса);
	ИначеЕсли ДанныеЗапроса.method = "smsoff" Тогда
		Возврат СообщениеПрочитано(ДанныеЗапроса);
	ИначеЕсли ДанныеЗапроса.method = "contakt" Тогда
		Возврат СвязатьКонтрагента(ДанныеЗапроса);
	ИначеЕсли ДанныеЗапроса.method = "svias" Тогда
		Возврат СоздатьИСвязатьКонтрагента(ДанныеЗапроса);		
	КонецЕсли;	

	     
	Возврат ПростойУспешныйОтвет();
	
КонецФункции
                                                                         
#КонецОбласти

#Область Процедуры_И_Функции_Программы

///////отправляем сообщения в вайбер ////////////////////////////////////////
Функция ОбработатьИОтправитьВсемСообщения(ДанныеЗапроса)
	
	Если ДанныеЗапроса.Свойство("Контакты") Тогда
		СписокПолучателей = ПолучитьСписокПолучателей(ДанныеЗапроса.Контакты, ДанныеЗапроса);
	КонецЕсли;
	
	ЧатБот = Справочники.НастройкиViber.НайтиПоКоду("000000001");
	
	НовоеСообщение = ДанныеЗапроса.НовоеСообщение;
	
	Если ДанныеЗапроса.Свойство("СтруктуруФайла") Тогда
		
		СтруктуруФайлаНаОтправку = ПолучитьСтруктуруФайлаНаОтправку(ДанныеЗапроса.СтруктуруФайла);
		
	КонецЕсли;	
	
	Для Каждого Стр Из СписокПолучателей Цикл
		
		Если ЗначениеЗаполнено(НовоеСообщение) Тогда
			Ответ = МодульУправленияViber.ОтправитьСообщениеПользователю(ЧатБот, Стр.Ссылка, НовоеСообщение);
				
			Если Ответ.Свойство("status_message") Тогда
				Если Ответ.status_message = "ok" Тогда
					МодульУправленияViber.ЗарегистрироватьСообщениеПользователяИсходящее(Ответ, Неопределено, Стр.Ссылка, ЧатБот, НовоеСообщение, ПользователиИнформационнойБазы.ТекущийПользователь());    
				КонецЕсли;			
			КонецЕсли;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтруктуруФайлаНаОтправку) Тогда
			Ответ = МодульУправленияViber.ОтправитьСообщениеФайлПользователю(ЧатБот, Стр.Ссылка, СтруктуруФайлаНаОтправку);
			Если Ответ.Свойство("status_message") Тогда
				Если Ответ.status_message = "ok" Тогда
					МодульУправленияViber.ЗарегистрироватьСообщениеПользователяИсходящее(Ответ, СтруктуруФайлаНаОтправку, Стр.Ссылка, ЧатБот, НовоеСообщение, ПользователиИнформационнойБазы.ТекущийПользователь());  	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;	
	
	
	Возврат ПростойУспешныйОтвет();		
	
КонецФункции

///// получаем список получателей из контрагентов ///////////////////////////
Функция ПолучитьСписокПолучателей(СписокКонтрагентовСтрокой, ДанныеЗапроса)
	
	МассивКонтрагентов = Новый Массив;
	
	Если ДанныеЗапроса.КонтрагентСсылка Тогда
		Для Каждого Стр из СписокКонтрагентовСтрокой Цикл
			Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр));
			Если ЗначениеЗаполнено(Контрагент) Тогда
				МассивКонтрагентов.Добавить(Контрагент);
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтактыViber.Ссылка
			|ИЗ
			|	Справочник.КонтактыViber КАК КонтактыViber
			|ГДЕ
			|	КонтактыViber.Контрагент В(&Контрагент)
			|	И КонтактыViber.СтатусДиалога = &СтатусДиалога";
		
		Запрос.УстановитьПараметр("Контрагент", МассивКонтрагентов);
		Запрос.УстановитьПараметр("СтатусДиалога", Перечисления.СтатусДиалога.Разрешон);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Возврат РезультатЗапроса;
	Иначе
		Для Каждого Стр из СписокКонтрагентовСтрокой Цикл
			УИДКонтакта = Новый УникальныйИдентификатор(Стр);
			СпрКонтакт = Справочники.КонтактыViber.ПолучитьСсылку(УИДКонтакта);
			Если СсылкаСуществует(СпрКонтакт) Тогда
				МассивКонтрагентов.Добавить(Новый Структура("Ссылка", СпрКонтакт.Ссылка));
			КонецЕсли;
		КонецЦикла;	
				
		Возврат МассивКонтрагентов; 
	КонецЕсли;	
	   
	   
		
	
КонецФункции	

/////Сформировать структуру файла на отправку сервере //////////////////////
Функция ПолучитьСтруктуруФайлаНаОтправку(ДанныеФайла)
	
	ДвДанные = base64значение(ДанныеФайла.Строка64);
	
	Настройкки = Справочники.НастройкиViber.НайтиПоКоду("000000001");
	ИмяФайлаТут = "" + Настройкки.КаталогДляСохранения + "" + ДанныеФайла.ИмяФайла;
	
	ДвДанные.Записать(ИмяФайлаТут);
	
	Файл = Новый Файл(ИмяФайлаТут);
	
	Имя = Файл.Имя;
	Размер   = Файл.Размер();
	Путь     = "" + Настройкки.КаталогДляОтправки + "" + Имя;
	
	
	Если ДанныеФайла.ТипФайлаОтправки = "Изображение" и Размер < 300000  Тогда
		ТипФайлаОтправки = Перечисления.ТипФайлаОтправки.Изображение;
	ИначеЕсли ДанныеФайла.ТипФайлаОтправки = "Видео" и Размер < 500000000 Тогда
		ТипФайлаОтправки = Перечисления.ТипФайлаОтправки.Видео;
	Иначе
		ТипФайлаОтправки = Перечисления.ТипФайлаОтправки.Файл;
	КонецЕсли;	

	
	СтруктураФайла = Новый Структура("Имя, Размер, Путь, ТипФайла, ФайлТам", Имя, Размер, Путь, ТипФайлаОтправки, ИмяФайлаТут);
	
	Возврат СтруктураФайла;
	
	
КонецФункции

/////// убераем отметку новое сообщение ////////////////////////////////////
Функция СообщениеПрочитано(ДанныеЗапроса)
	
	Если ДанныеЗапроса.Свойство("Контрагент") Тогда
		Если ДанныеЗапроса.КонтрагентСсылка Тогда 
			Контакт = ПолучитьКонтактПоКонтрагенту(ДанныеЗапроса.Контрагент);
		Иначе
			УИД = Новый УникальныйИдентификатор(ДанныеЗапроса.Контрагент);
			СпрКонтрагент = Справочники.КонтактыViber.ПолучитьСсылку(УИД);
			
			Контакт = СпрКонтрагент.Ссылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Контакт) Тогда
			Спр = Контакт.ПолучитьОбъект();
			Спр.НовоеСообщение = Ложь;
			Спр.Записать();
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ПростойУспешныйОтвет();	
	
КонецФункции	

/////// получить список и структуру сообщений //////////////////////////////
Функция СформироватьИОтправитьРегистрСообщений(ДанныеЗапроса)Экспорт
	
	Дата = ДанныеЗапроса.Дата; 
	ТовАгент = Справочники.ТорговыеАгенты.НайтиПоРеквизиту("ПарольДоступаАндроід", ДанныеЗапроса.IDdesktop);
	Если НЕ ЗначениеЗаполнено(ТовАгент) Тогда
		Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
	КонецЕсли;	
	
	Если Дата = "0" Тогда
		ДатаОбновления = Дата("01.01.2023 00:00:01");
	Иначе
		ДатаСтрокой = Лев(Дата, 2) + "." + Сред(Дата, 3,2) + "." + Сред(Дата, 5, 4) + " " + Сред(Дата, 9, 2) + ":" + Сред(Дата, 11, 2) + ":" + Сред(Дата, 13, 2);
		Попытка
			ДатаОбновления = Дата(ДатаСтрокой);
		Исключение
			ДатаОбновления = Дата("01.01.2023 00:00:01");
		КонецПопытки	
	КонецЕсли;
	
	МассивСообщений = Новый  Массив;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ViberИсторииСообщений.Контакт,
		|	ViberИсторииСообщений.Дата,
		|	ViberИсторииСообщений.Напрвление,
		|	ViberИсторииСообщений.ЧатID,
		|	ViberИсторииСообщений.ТокенСообщния,
		|	ViberИсторииСообщений.ИсточникПривличения,
		|	ViberИсторииСообщений.Непрочитаное,
		|	ViberИсторииСообщений.Картинка,
		|	ViberИсторииСообщений.Файл,
		|	ViberИсторииСообщений.Видео,
		|	ViberИсторииСообщений.Текст,
		|	ViberИсторииСообщений.ПутьКФайлу,
		|	ViberИсторииСообщений.Размер,
		|	ViberИсторииСообщений.Наименование,
		|	ViberИсторииСообщений.Менеджер,
		|	ViberИсторииСообщений.ФайлВБазе,
		|	ViberИсторииСообщений.Прочтено,
		|	ViberИсторииСообщений.Доставлено,
		|	ViberИсторииСообщений.Контакт.Контрагент КАК Контрагент,
		|	ViberИсторииСообщений.Контакт.НовоеСообщение КАК НовоеСообщение,
		|	ViberИсторииСообщений.Контакт.Подписан КАК Подписан
		|ИЗ
		|	РегистрСведений.ViberИсторииСообщений КАК ViberИсторииСообщений
		|ГДЕ
		|	ViberИсторииСообщений.Дата >= &Дата
		|	И ViberИсторииСообщений.Контакт.Менеджер = &Менеджер";
	
	Запрос.УстановитьПараметр("Дата", ДатаОбновления);
	Запрос.УстановитьПараметр("Менеджер", ТовАгент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Если ЗначениеЗаполнено(Выборка.Контрагент) Тогда
		Если СсылкаСуществует(Выборка.Контакт) Тогда 
				
			СтруктураСообщения = Новый Структура;
			СтруктураСообщения.Вставить("Контакт", Строка(Выборка.Контакт));
			СтруктураСообщения.Вставить("Дата", СформироватьДатуДляОттправки(Выборка.Дата));//Формат(Выборка.Дата,"ДФ=yyyy-MM-dd"));
			СтруктураСообщения.Вставить("Напрвление", Строка(Выборка.Напрвление));
			СтруктураСообщения.Вставить("ЧатID", Выборка.ЧатID);
			СтруктураСообщения.Вставить("ТокенСообщния", Выборка.ТокенСообщния);
			СтруктураСообщения.Вставить("ИсточникПривличения", Строка(Выборка.ИсточникПривличения));
			СтруктураСообщения.Вставить("Непрочитаное", Выборка.Непрочитаное);
			СтруктураСообщения.Вставить("Картинка", Выборка.Картинка);
			СтруктураСообщения.Вставить("Файл", Выборка.Файл);
			СтруктураСообщения.Вставить("Видео", Выборка.Видео);
			СтруктураСообщения.Вставить("Подписан", Выборка.Подписан);

			Если ЗначениеЗаполнено(Выборка.Контрагент) Тогда
				СтруктураСообщения.Вставить("Контрагент", СформироватьСтруктуруКонтрагент(Выборка.Контрагент));
			Иначе
				СтруктураСообщения.Вставить("Контрагент", СформироватьСтруктуруКонтрагент(Выборка.Контрагент));
			КонецЕсли;	
			СтруктураСообщения.Вставить("КлиентВайбер", Строка(Выборка.Контакт.УникальныйИдентификатор()));

			
			СтруктураСообщения.Вставить("Текст", ?(ЗначениеЗаполнено(Выборка.Текст), Выборка.Текст, ""));  
			СтруктураСообщения.Вставить("ПутьКФайлу", ?(ЗначениеЗаполнено(Выборка.ПутьКФайлу), Выборка.ПутьКФайлу, "")); 
			СтруктураСообщения.Вставить("Размер", ?(ЗначениеЗаполнено(Выборка.Размер), Выборка.Размер, "")); 
			СтруктураСообщения.Вставить("Наименование", ?(ЗначениеЗаполнено(Выборка.Наименование), Выборка.Наименование, "")); 
			СтруктураСообщения.Вставить("Менеджер", ?(ЗначениеЗаполнено(Выборка.Менеджер), ПолучитьИдентификаторУчастникаЧата(Выборка.Менеджер), "")); 
			СтруктураСообщения.Вставить("ФайлВБазе", ?(ЗначениеЗаполнено(Выборка.ФайлВБазе), Выборка.ФайлВБазе, "")); 
					
			СтруктураСообщения.Вставить("НовоеСообщение", Выборка.НовоеСообщение);
			СтруктураСообщения.Вставить("Прочтено", Выборка.Прочтено);
			СтруктураСообщения.Вставить("Доставлено", Выборка.Доставлено);
			

			МассивСообщений.Добавить(СтруктураСообщения);
		КонецЕсли;		
	КонецЦикла;
	
	МассивШаблонов = Новый Массив;
	СписокШаблонов = Справочники.ШаблоныСообщений.Выбрать();
	Пока СписокШаблонов.Следующий() Цикл
		Если НЕ СписокШаблонов.ПометкаУдаления Тогда
			МассивШаблонов.Добавить(Новый Структура("Код, Текст, Наименование", СписокШаблонов.Код, СписокШаблонов.Текст, СписокШаблонов.Наименование));
		КонецЕсли;	
	КонецЦикла;	
	
	МассивНовых = Новый Массив;
	НовыеКонтакты = ПолучитьСписокНовыхКонтактов(ТовАгент);
	Для Каждого Ст из НовыеКонтакты Цикл    		                                                                                                                                         
		МассивНовых.Добавить(Новый Структура("ИДКонтакта, Наименование, Телефон, Дата, Идентификатор", Строка(Ст.Ссылка.УникальныйИдентификатор()), Ст.Наименование, Ст.Телефон, Строка(Ст.ДатаПодписки), Ст.Идентификатор));
	КонецЦикла;
	
	СписокКонтактов = ПолучитьСписокКонтактовВайбер();
	МассивКонтактыВайбер = Новый Массив();
	Для Каждого Ст из СписокКонтактов Цикл    		                                                                                                                                         
		МассивКонтактыВайбер.Добавить(Новый Структура("ИДКонтакта, Наименование, Телефон, Дата, Идентификатор, ИДКонтрагента, Статус, Сесия"
		, Строка(Ст.Ссылка.УникальныйИдентификатор()), Ст.Наименование, Ст.Телефон, Строка(Ст.ДатаПодписки), Ст.Идентификатор
		,  Строка(?(ТипЗнч(Ст.Контрагент) = Тип("СправочникСсылка.Контрагенты"),Ст.Контрагент.УникальныйИдентификатор(), Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"))), Строка(Ст.Статус), Строка(Ст.Сесия)));
	КонецЦикла;
	
	
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("МассивСообщений", МассивСообщений);
	СтруктураОтвета.Вставить("Шаблоны", МассивШаблонов);
	СтруктураОтвета.Вставить("НовыеКонтакты", МассивНовых);
	СтруктураОтвета.Вставить("МассивКонтактыВайбер", МассивКонтактыВайбер);

	
	
	Возврат ОтветJSON(СтруктураОтвета);
	
	
КонецФункции

////// получить контакт по контрагенту ////////////////////////////////////
Функция ПолучитьКонтактПоКонтрагенту(ИДКонтрагента)
	
	Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДКонтрагента));
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтактыViber.Ссылка
			|ИЗ
			|	Справочник.КонтактыViber КАК КонтактыViber
			|ГДЕ
			|	КонтактыViber.Контрагент = &Контрагент";
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
	
	Возврат Справочники.КонтактыViber.ПустаяСсылка();
		
	
	
КонецФункции

////// связываем контрагента //////////////////////////////////////////////
Функция СвязатьКонтрагента(ДанныеЗапроса)
	
	УИДКонтрагента = Новый УникальныйИдентификатор(ДанныеЗапроса.Контрагент);
	СправочникКонтрагент = Справочники.Контрагенты.ПолучитьСсылку(УИДКонтрагента);
	Если СсылкаСуществует(СправочникКонтрагент) Тогда

		УИДКонтакт = Новый УникальныйИдентификатор(ДанныеЗапроса.Контакт);
	    СправочникКонтакт = Справочники.КонтактыViber.ПолучитьСсылку(УИДКонтакт);
		Если СсылкаСуществует(СправочникКонтакт) Тогда
			Спр = СправочникКонтакт.ПолучитьОбъект();
			Спр.Контрагент = СправочникКонтрагент.Ссылка;
			Спр.Записать();
			
			///////обновяем список сообщений /////////////////////////////////
			
			МассивСообщений = Новый Массив;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ViberИсторииСообщений.ТокенСообщния
				|ИЗ
				|	РегистрСведений.ViberИсторииСообщений КАК ViberИсторииСообщений
				|ГДЕ
				|	ViberИсторииСообщений.Контакт = &Контакт";
			
			Запрос.УстановитьПараметр("Контакт", СправочникКонтакт);
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			Для Каждого Стр из РезультатЗапроса Цикл
				
				МассивСообщений.Добавить(Новый Структура("Токен, Контрагент", СтрЗаменить(Стр.ТокенСообщния, Символ(160), ""), Строка(СправочникКонтакт.УникальныйИдентификатор())));
		
			КонецЦикла;	
			
			
			СтруктураОтвета = Новый Структура();
			СтруктураОтвета.Вставить("Result", "Ok");
			СтруктураОтвета.Вставить("СписокСообщений", МассивСообщений);
			
			
			Возврат ОтветJSON(СтруктураОтвета);

		КонецЕсли;
	КонецЕсли;
	
	
	СтруктураОтвета = Новый Структура();
	СтруктураОтвета.Вставить("Result", "Net");
	СтруктураОтвета.Вставить("Текст", "Щось пішло не так");
	
	
	Возврат ОтветJSON(СтруктураОтвета);
	
	
КонецФункции	


/////// создать и связать контрагента ////////////////////////////////////
Функция СоздатьИСвязатьКонтрагента(ДанныеЗапроса)
	
	УИДКонтрагента = Новый УникальныйИдентификатор(ДанныеЗапроса.Контрагент);
	СправочникКонтрагент = Справочники.Контрагенты.ПолучитьСсылку(УИДКонтрагента);
	Если СсылкаСуществует(СправочникКонтрагент) Тогда
		УИДКонтакт = Новый УникальныйИдентификатор(ДанныеЗапроса.Контакт);
	    СправочникКонтакт = Справочники.КонтактыViber.ПолучитьСсылку(УИДКонтакт);
		Если СсылкаСуществует(СправочникКонтакт) Тогда
			Спр = СправочникКонтакт.ПолучитьОбъект();
			Спр.Контрагент = СправочникКонтрагент.Ссылка;
			Спр.Записать();
		КонецЕсли;
	ИначеЕсли ДанныеЗапроса.Свойство("Пароль") Тогда 
		
		ОбменАРМ.ОбработатьПакетДанных(ДанныеЗапроса.Пароль, XMLЗначение(Тип("ХранилищеЗначения"), ДанныеЗапроса.ДанныеКонтрагента)	);
		
	Иначе
		ТипЦен = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(ДанныеЗапроса.ТипЦен);

		Спр = Справочники.Контрагенты.СоздатьЭлемент();
		Спр.ОбменДанными.Загрузка = Истина;
		Спр.УстановитьСсылкуНового(СправочникКонтрагент);
		Спр.Наименование       = ДанныеЗапроса.Наименование;
		Спр.НаименованиеПолное = ДанныеЗапроса.Наименование;
		Спр.НомерТелефона      = ДанныеЗапроса.Телефон;
		Спр.Записать();
		
		Договора = СоздатьДоговорыКонтрагенту(Спр.Ссылка, ТипЦен);
		Спр.ОсновнойДоговорКонтрагента = Договора.ОсновнойДоговорКонтрагента;
		Спр.ДоговорДляНеплановыхПродаж = Договора.ДоговорДляНеплановыхПродаж;
		Спр.Записать();

		
		УИДКонтакт = Новый УникальныйИдентификатор(ДанныеЗапроса.Контакт);
		
	КонецЕсли;
	
	УИДКонтакт = Новый УникальныйИдентификатор(ДанныеЗапроса.Контакт);
	СправочникКонтакт = Справочники.КонтактыViber.ПолучитьСсылку(УИДКонтакт);
	Если СсылкаСуществует(СправочникКонтакт) Тогда
		Спр = СправочникКонтакт.ПолучитьОбъект();
		Спр.Контрагент = СправочникКонтрагент.Ссылка;
		Спр.Записать();
	КонецЕсли;	
	
	МассивСообщений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ViberИсторииСообщений.ТокенСообщния
		|ИЗ
		|	РегистрСведений.ViberИсторииСообщений КАК ViberИсторииСообщений
		|ГДЕ
		|	ViberИсторииСообщений.Контакт = &Контакт";
	
	Запрос.УстановитьПараметр("Контакт", СправочникКонтакт);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр из РезультатЗапроса Цикл
		
		МассивСообщений.Добавить(Новый Структура("Токен, Контрагент", СтрЗаменить(Стр.ТокенСообщния, Символ(160), ""), Строка(СправочникКонтакт.УникальныйИдентификатор())));

	КонецЦикла;	
	
	
	СтруктураОтвета = Новый Структура();
	СтруктураОтвета.Вставить("Result", "Ok");
	СтруктураОтвета.Вставить("СписокСообщений", МассивСообщений);
	
	
	Возврат ОтветJSON(СтруктураОтвета);
	
		
 
	
	
КонецФункции	

Функция СформироватьДатуДляОттправки(Дата)
	
	ДатаСтрокой = СтрЗаменить(Строка(Дата), ".", "");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, " ", "");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ":", "");
	
	Возврат  ДатаСтрокой;
	
КонецФункции

Функция СформироватьСтруктуруКонтрагент(Контрагент)
	
	МассивТелефонов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НомерТелефона,
		|	ВложенныйЗапрос.Номер
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КонтрагентыДополнительныеНомераТелефонов.Номер КАК Номер,
		|			КонтрагентыДополнительныеНомераТелефонов.Ссылка КАК Ссылка
		|		ИЗ
		|			Справочник.Контрагенты.ДополнительныеНомераТелефонов КАК КонтрагентыДополнительныеНомераТелефонов) КАК ВложенныйЗапрос
		|		ПО Контрагенты.Ссылка = ВложенныйЗапрос.Ссылка
		|ГДЕ
		|	Контрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр из РезультатЗапроса Цикл
		Если ЗначениеЗаполнено(Стр.Номер) Тогда
			МассивТелефонов.Добавить(ОтформатироватьТелефон(Стр.Номер));
		КонецЕсли;
	КонецЦикла;
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(РезультатЗапроса[0].НомерТелефона) Тогда
			МассивТелефонов.Добавить(ОтформатироватьТелефон(РезультатЗапроса[0].НомерТелефона));		
		КонецЕсли;
	КонецЕсли;
	
	СтруктураКонтрагент = Новый Структура("Телефон", МассивТелефонов);
	СтруктураКонтрагент.Вставить("Наименование", Контрагент.Наименование);
	СтруктураКонтрагент.Вставить("Код", Контрагент.Код);
	СтруктураКонтрагент.Вставить("ИД", Строка(Контрагент.УникальныйИдентификатор()));

	
	Возврат СтруктураКонтрагент;
	
	
КонецФункции
		
Функция ОтформатироватьТелефон(Номер)
	
	НовСтрока = "";
  
	ПравильныеСимволы = "0123456789";
    
	Для Сч = 1 по СтрДлина(Номер) Цикл
    	ТекСимв = Сред(Номер, Сч, 1);
   		Если Найти(ПравильныеСимволы, ТекСимв) > 0 Тогда
    		НовСтрока = НовСтрока + ТекСимв;
    	КонецЕсли;
	КонецЦикла;
       

	Возврат НовСтрока;

	
КонецФункции	

Функция ПолучитьИдентификаторУчастникаЧата(Менеджер)
	
  //Агент = Справочники.ТорговыеАгенты.НайтиПоРеквизиту("Користувач", Менеджер);
  //Если ЗначениеЗаполнено(Агент) Тогда
  Возврат Строка(Менеджер.Користувач.УникальныйИдентификатор());
  //Иначе
  //    Возврат "";
  //КонецЕсли;	  
	
	
КонецФункции	

Функция ПолучитьСписокНовыхКонтактов(Менеджер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактыViber.Телефон,
		|	КонтактыViber.Наименование,
		|	КонтактыViber.ДатаПодписки,
		|	КонтактыViber.Идентификатор,
		|	КонтактыViber.Ссылка
		|ИЗ
		|	Справочник.КонтактыViber КАК КонтактыViber
		|ГДЕ
		|	КонтактыViber.Контрагент = &Контрагент
		|	И КонтактыViber.СтатусДиалога = &СтатусДиалога
		|	И НЕ КонтактыViber.ПометкаУдаления
		|	И КонтактыViber.Менеджер = &Менеджер";
	
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусДиалога", Перечисления.СтатусДиалога.Разрешон);
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса; 	
		
КонецФункции

Функция ПолучитьСписокКонтактовВайбер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактыViber.Телефон,
		|	КонтактыViber.Наименование,
		|	КонтактыViber.ДатаПодписки,
		|	КонтактыViber.Идентификатор,
		|	КонтактыViber.Ссылка,
		|	КонтактыViber.Контрагент.Ссылка КАК Контрагент,
		|	КонтактыViber.СтатусДиалога Как Статус,
		|	КонтактыViber.ОстатокСесии КАК Сесия
		|ИЗ
		|	Справочник.КонтактыViber КАК КонтактыViber
		|ГДЕ
		|	НЕ КонтактыViber.ПометкаУдаления
		|	И КонтактыViber.Контрагент <> &Контрагент";
	
	//Запрос.УстановитьПараметр("СтатусДиалога", Перечисления.СтатусДиалога.Разрешон);
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса; 	
		
КонецФункции

////// проверяем на уид /////////////////////////////////////
Функция СсылкаСуществует(ПроверяемаяСсылка) Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	&ИмяТаблицы КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяТаблицы", ИмяТаблицыПоСсылке(ПроверяемаяСсылка));
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ПроверяемаяСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ИмяТаблицыПоСсылке(Ссылка) Экспорт
	
	Возврат Ссылка.Метаданные().ПолноеИмя();
	
КонецФункции

Функция СоздатьДоговорыКонтрагенту(Контрагент, ТипЦен)
	
	НовДог = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовДог.Владелец = Контрагент;
	НовДог.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");
	НовДог.Наименование = "Основний";
	НовДог.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
	НовДог.ВестиПоДокументамРасчетовСКонтрагентом = Истина;
	НовДог.ВидВзаиморасчетов = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	НовДог.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчета.Получить();
	НовДог.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	НовДог.ТипЦен = ТипЦен;
	//НовДог.ОбособленноеПодразделение = Склад.Подразделение.РСП;
	НовДог.Записать();
	//ТекКонтрОб.ОсновнойДоговорКонтрагента = НовДог.Ссылка;
	
	// Неплановий
	
	НовДогНепл = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовДогНепл.Владелец = Контрагент;
	НовДогНепл.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");
	НовДогНепл.Наименование = "Непланові продажі";
	НовДогНепл.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	НовДогНепл.ВестиПоДокументамРасчетовСКонтрагентом = Истина;
	НовДогНепл.ВидВзаиморасчетов = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	НовДогНепл.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчета.Получить();
	НовДогНепл.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
	НовДогНепл.ТипЦен = ТипЦен;
	//НовДог.ОбособленноеПодразделение = Склад.Подразделение.РСП;
	НовДогНепл.Записать();
	
	Ответ = Новый Структура;
	Ответ.Вставить("ОсновнойДоговорКонтрагента",НовДог.Ссылка);
	Ответ.Вставить("ДоговорДляНеплановыхПродаж", НовДогНепл.Ссылка);
	Возврат Ответ;	
КонецФункции


#КонецОбласти
